Repository: SethArchambault/BikeBlacklist
Catalog: public/lib/asaglimbeni-clean-image-crop-uploader-ab04b57/cicu/locale/*/LC_MESSAGES/django.po
Languages: it

source: creation date
it: data creazione

source: uploaded file
it: file caricato

source: uploaded files
it: file caricato

source: Upload image
it: Carica immagine

source: Change Image
it: Cambia immagine

source: Warning: the area selected is little, min size:
it: Attenzione: l'area selezionata Ã¨ troppo piccola

source: Image don't have minimal size
it: L'immagine non ha la grandeza minima

source: Set image
it: Ritaglia

source: Close
it: Chiudi

source: Uploading your image
it: Sto caricando l'immagine

source: Select image from your computer
it: Seleziona un immagine dal tuo computer
